# Напишіть програму, яка отримує три цілих числа, введені з клавіатури
# (кожне число вводиться на окремому рядку), і друкує на екрані їх суму,
# добуток, результат піднесення першого числа до степеня різниці другого і третього чисел.

num1 = int(input('Введіть перше число: '))
num2 = int(input('Введіть друге число: '))
num3 = int(input('Введіть третє число: '))

print(num1 + num2 + num3, '-> Сума')
print(num1 * num2 * num3, '-> Добуток')
print(num1 ** (num2 - num3), '-> Піднесення першого числа до степеня різниці другого і третього чисел')
