# В деякій школі заняття починаються о 9:00. Тривалість уроку - 45 хвилин,
# після 1-го, 3-го, 5-го і т. д. уроків перерва 5 хвилин, а після 2-го, 4-го, 6-го і т. д. - 15 хвилин.
# Вводиться номер уроку (число від 1 до 10). Визначте, коли закінчується зазначений урок, а саме,
# виведіть два цілих числа: час закінчення уроку в годинах і хвилинах.

n = int(input("Enter number of lesson: "))

for n in range (1, n+1):
    lesson_time = n * 45
    short_breaks = n // 2 * 5
    long_breaks = (n - 1) // 2 * 15
    total_time = lesson_time + short_breaks + long_breaks
    hh, mm = divmod(total_time, 60)
    print('lesson', n, '->', f"{(9 + hh):02}",  f"{(0 + mm):02}")
