# Напишіть програму, яка друкує цілі числа від 1 до n (1 < n ≤ 1000) з такою умовою:
# для чисел кратних 3 виводить *3* замість числа, для чисел кратних 5 друкує *5*,
# а для чисел, які кратні 3 і 5 одночасно, повідомлення буде *35*.

n = int(input("Enter number n: "))

for i in range(1, 1001):
    if i % 3 == 0 and i % 5 == 0:
        print("*35*")
        continue
    elif i % 3 == 0:
        print("*3*")
        continue
    elif i % 5 == 0:
        print("*5*")
        continue
    elif i > n:
        break
    print(i)