# Автогонщик в перший день ралі проїхав d км. Кожен наступний день він збільшував пробіг
# на 10% від пробігу попереднього дня. Через скільки днів автоспортивних змагань сумарний
# пробіг автомобіля за всі дні перевищить t км і яке значення сумарного пробігу?
# Введення даних користувачем відбувається в порядку: d, t.

d = int(input("Enter distans of 1 day: "))
t = int(input("Enter check distans: "))
day = 1

while d < t:
    day += 1
    d += d * 0.1

print(f"{d:.2f} km")
print (f"{day} days")
