# Напишіть програму, яка виводить двовимірну квадратну таблицю n x n чисел (n - ціле число, яке вводить користувач).
# По головній діагоналі таблиці (від лівого верхнього значення до нижнього правого значення) мають розміщуватися 0,
# вище головної діагоналі розміщуються 1, а нижче - -1. Для гарного відображення таблиці при виведенні її значень
# використовуйте символ табуляції \t.
#  Вхідні дані:
#  5
# Вихідні дані:
#  0	1	1	1	1
# -1	0	1	1	1
# -1	-1	0	1	1
# -1	-1	-1	0	1
# -1	-1	-1	-1	0

# n = int(input("Enter n: "))
n = 10

for i in range(1, n+1):
    for j in range(1, n+1):
        if i == j:
            print(0, end='\t')
        if i < j:
            print(1, end='\t')
        if i > j:
            print(-1, end='\t')
    print()