# Дано цілі числа a і b (a > b). Визначити результати цілочисельного ділення a на b
# і залишку від ділення a на b, не використовуючи стандартні операції цілочисельного
# ділення і залишку від ділення. Результати необхідно вивести в одному рядку,
# спочатку результат цілочисельного ділення, а потім залишок від ділення, розділені одним пропуском.

a = 16
b = 5
intdiv = 0

while a > b:
    intdiv += 1
    a -= b

print(intdiv, a)

