# В одній країні використовуються грошові купюри номіналом в 1, 2, 4, 8, 16, 32 і 64.
# Дано натуральне число n. Якою найменшою кількістю таких грошових знаків можна виплатити суму n
# (вказати кількість кожної з використовуваних для виплати купюр)?
# Передбачається, що є досить велика кількість купюр всіх номіналів.
# Вхідні дані:
# 165
# Вихідні дані:
# 2 (64)
# 1 (32)
# 1 (4)
# 1 (1)

n = 165
banknote = [1, 2, 4, 8, 16, 32, 64]
banknote.sort(reverse=True)

while n > 0:
    for nominal in banknote:
        if n // nominal != 0:
            print(n // nominal, f'({nominal})')
        n = n % nominal