# Задумали два натуральних числа x і y (x, y ≤ 1000).
# Щоб відгадати ці числа, називають суму цих чисел a і їх добуток b.
# Відгадайте ці числа і виведіть їх в порядку зростання, розділяючи пропуском.

# sum = int(input('Введіть суму двох чисел: '))
# mult = int(input('Введіть добуток двох чисел: '))

sum = 9
mult = 20
num = []

for x in range(0,1001):
    for y in range(0,1000):
        if x + y == sum and x * y == mult:
            num.append(x)
            num.append(y)

print(min(num), max(num))
