# Напишіть програму, яка по введеному числу n від 1 до 9 виводить на екран n пінгвінів
# з відповідним номером - число від 1 до n. Зображення одного пінгвіна має розмір 5 x 9 символів,
# між двома сусідніми пінгвінами також є порожній (з пропусків) стовпець.
# Дозволяється вивести порожній стовпець після останнього пінгвіна.
# Для спрощення малювання скопіюйте пінгвіна із вихідних даних.
# Врахуйте, що виведення на екран виконується порядково, а не «попінгвінно».
# Вхідні дані:
# 4
# Вихідні дані:
#    _~_        _~_        _~_        _~_
#   (o o)      (o o)      (o o)      (o o)
#  /  V  \    /  V  \    /  V  \    /  V  \
# /(  1  )\  /(  2  )\  /(  3  )\  /(  4  )\
#   ^^ ^^      ^^ ^^      ^^ ^^      ^^ ^^

n = 9

print("_~_".center(10) * n, end=' ')
print()
print("(o o)".center(10) * n, end=' ')
print()
print("/  V  \\".center(10) * n, end=' ')
print()
print(''.join([f"/(  {n}  )\\".center(10) for n in range(1, n+1)]), end=' ')
print()
print("^^ ^^".center(10) * n, end=' ')
