# Знайти у рядку зазначений підрядок і замінити його на новий.
# Рядок, підрядок для заміни та новий рядок вводить користувач.
# Розгляньте випадок заміни усіх підрядків. Також необхідно врахувати випадок
# відсутності підрядка, який необхідно замінити (вивести is impossible).
# Вхідні дані:
# 12 45 32 567 32 109
# 32
# 0
# 12 45 32 567 32 109
# 33
# -1
# Вихідні дані:
# 12 45 0 567 0 109
# is impossible

text = '12 45 32 567 32 109'
strg_out = '32'
strg_in = '0'

print(text.replace(strg_out, strg_in)) if strg_out in text else print('is impossible')
