# Для введеної послідовності цілих чисел обміняйте сусідні елементи у парах (A[0] з A[1], A[2] з A[3] і т. д.).
# Надрукуйте отриманий список. Якщо в списку є непарне число елементів, залиште останній елемент на місці.
# Вхідні дані:
# 1 4 5 3 7
# 4 2 10 5
# 2
# Вихідні дані:
# 4 1 3 5 7
# 2 4 5 10
# 2

lst = [4, 2, 5, 10, 11]
print(lst)

for i in range(0, len(lst) - 1, 2):
    lst[i], lst[i+1] = lst[i+1], lst[i]
print(lst)

for i in range(len(lst)):
    if i % 2 != 0:
        lst.insert(i - 1, lst.pop(i))
print(lst)
