# Напишіть програму, яка зчитує числа (по одному в рядку) до тих пір, поки сума введених чисел
# не буде дорівнює 0 і відразу після цього виводить суму квадратів всіх чисел.
# Гарантується, що в якийсь момент сума введених чисел дорівнюватиме 0,
# після цього зчитування продовжувати не потрібно.
# Вхідні дані:
# 2
# 3
# -6
# 1
# Вихідні дані:
# 50

summ = 0
nmbrs = []

while True:
    n = int(input('Enter number: '))
    nmbrs.append(n)
    summ += n
    if summ == 0:
        break

print(sum([n ** 2 for n in nmbrs]))
