# Дано дві цілочисельні послідовності, елементи яких розділені пропуском і комою.
# Напишіть програму, яка повертає послідовність, що містить лише елементи,
# які є загальними між введеними послідовностями (без дублікатів).
# Переконайтеся, що ваша програма працює на двох послідовностях різних розмірів.
# Вхідні дані:
# 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89
# 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13
# Вихідні дані:
# 1 2 3 5 8 13

nums1 = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
nums2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
nmbrs = []

if len(nums1) > len(nums2):
    nmbrs = [nums for nums in nums1 if nums in nums2]
else:
    nmbrs = [nums for nums in nums2 if nums in nums1]

print(nmbrs)
