# Напишіть програму, яка приймає на вхід список чисел і число (в окремих рядках),
# після чого виводить всі позиції через пропуск, на яких це число зустрічається в переданому списку
# (позиції у списку нумеруються з 1). Позиції повинні бути виведені в порядку зростання.
# Якщо число не знайдено в списку, потрібно вивести рядок None (без лапок, з великої літери).
# Вхідні дані:
# 5 7 3 4 9 8 4 7 4
# 4
# Вихідні дані:
# 4 7 9

nmbrs = [5, 7, 3, 4, 9, 8, 4, 7, 4]
nmb = 4

for i, j in list(enumerate(nmbrs, 1)):
    if j == nmb:
        print(i, end=' ')