# Кодування довжин послідовностей - це базовий алгоритм стиснення даних. Реалізуйте алгоритм дешифрування
# (декодування) рядків, закодованих за допомогою одного з найпростіших варіантів кодування довжин послідовностей.
# На вхід алгоритму подається рядок, що містить цифри і символи англійського алфавіту. Цей рядок розбивається на
# так звані серії (послідовності), які кодуються парою число-символ або просто символ (в такому випадку число
# вважається рівним одиниці). Результат повинен містити ці серії в тому ж порядку, що вони і зустрічаються в
# заданому рядку, при цьому кожна серія розгортається в послідовність символів відповідної довжини.
# Наприклад, закодований рядок 3ab4c2CaB розбивається на серії 3a b 4c 2C a B, після чого, перетворюючи серії,
# отримуємо початковий розкодований рядок aaabccccCCaB.

text_code = '3ab4c2CaB'
text_decode = []
i = 0
print(text_code)

while i < len(text_code):
    if text_code[i].isdigit() and text_code[i+1].isalpha() and i + 1 < len(text_code):
        text_decode.append(int(text_code[i]) * text_code[i+1])
        i += 2
    else:
        text_decode.append(text_code[i])
        i += 1

print("".join(text_decode))

