# Анаграма - переставлення літер у слові, завдяки чому утворюється нове значення слова.
# Напишіть програму, яка перевіряє, чи є два введених слова анаграмами.
# # Програма повинна вивести True в разі, якщо введені слова є анаграмами, і False в інших випадках.
# Слово може складатися тільки з англійських символів. Регістр букв не повинен впливати на відповідь.
# Вхідні дані:
# restful/fluster
# forty-five/over-fifty
# anagram/naganra
# Вихідні дані:
# True
# True
# False

word_1 = 'anagram'
word_2 = 'naganra'

print(sorted(word_1) == sorted(word_2))