# Написати програму, в якій зберігаються дані про товари, їх кількість і ціну.
# При запуску програми ця інформація виводиться на екран.
# Далі користувачеві має пропонуватися вводити номера товарів і їх нову кількість.
# Введення даних має завершуватися, якщо користувач вводить обумовлений символ (наприклад, нуль).
# Після цього всі дані про товари повинні знову виводитися на екран.
# Якщо номер товару відсутній, необхідно вивести відповідне повідомлення як у вихідних даних.

def dict_print(d:dict):
    for key, value in goods.items():
        print(key, end=' ')
        for val in value:
            print(val, end=' ')
        print()


goods = {1: ["Lenovo", 12, 1500],
         2: ["Aser", 7, 1200],
         3: ["Asus", 13, 1400],
         4: ["DELL", 21, 2600],
         5: ["Samsung", 5, 1550],
         6: ["hp", 9, 1270],}

dict_print(goods)

while True:
    good_number = int(input('Номер товару, для завершення введіть 0: '))
    if good_number == 0:
        break
    good_amount = int(input('Кількість товару: '))
    goods[good_number][1] = good_amount

dict_print(goods)
