# Дано два словники, в яких ключами є малі букви латинського алфавіту, а значеннями - цілі числа.
# В першому словнику можуть зустрічатися ключі чи значення, які присутні в другому словнику, або навпаки.
# Наприклад, вміст словників може бути наступний: a = {'x' : 1, 'y' : 2, 'z' : 3}, b = {'w' : 10, 'x' : 11, 'y' : 2}.
# Надрукуйте спільні ключі для обох словників в одному рядку через пропуск.
# Вхідні дані:
# Немає
# Вихідні дані:
# y x

a = {'x' : 1, 'y' : 2, 'z' : 3}
b = {'w' : 10, 'x' : 11, 'y' : 2}
ab_set = set(a.keys()).intersection(set(b.keys()))

for el in ab_set:
    print(el, end=" ")
