# Дано два дійсних числа x і y. Напишіть функцію для перевірки,
# чи належить точка з координатами (x, y) квадрату (включаючи його межу),
# що має розміри 2 х 2 клітинки і розташований в початку системи координат.
# Якщо точка належить квадрату, виведіть слово YES, інакше виведіть слово NO.
# Функція не повинна містити інструкцію «якщо».
# Вхідні дані:
# 2
# -1
# 1
# 1
# Вихідні дані:
# NO
# YES

def if_point_in_square(x, y, a = 2):
    return ["NO", "YES"][all([0 <= x <= a, 0 <= y <= a])]


print(if_point_in_square(2, -1))
print(if_point_in_square(1, 1))
