# Дано два дійсних числа x і y. Напишіть функцію для перевірки,
# чи належить точка з координатами (x, y) ромбу (включаючи його межу),
# що має розміри 1 х 1 клітинки і розташований в початку системи координат.
# Якщо точка належить ромбу, виведіть слово YES, інакше виведіть слово NO.
# Функція не повинна містити інструкцію «якщо».
# Вхідні дані:
# 1
# 1
# -0.6
# 0.3
# Вихідні дані:
# NO
# YES


def if_point_in_rhombus(x, y, a = 1):
    v = a / 2 ** 0.5
    return ["NO", "YES"][all([-v <= x <= v, -v <= y <= v])]


print(if_point_in_rhombus(1, 1))
print(if_point_in_rhombus(-0.6, 0.3))
