# Дано п’ять дійсних чисел: x, y, xc, yc, r. Напишіть функцію для перевірки,
# чи належить точка (x, y) колу з центром (xc, yc) і радіусом r.
# Якщо точка належить колу, виведіть слово YES, інакше виведіть слово NO.
# Функція не повинна містити інструкцію «якщо».
# Вхідні дані:
# 0
# 0
# 2
# 2
# 3

# 1
# 1
# 4
# 5
# 3
# Вихідні дані:
# YES
# NO

def if_point_in_circle(x, y, xc, yc, r):
    return ["NO", "YES"][(x - xc)**2 + (y - yc)**2 <= r**2]

print(if_point_in_circle(0, 0, 2, 2, 3))
print(if_point_in_circle(1, 1, 4, 5, 3))