# Напишіть функцію - простий лічильник відвідувань, яка отримує в циклі
# (до тих пір, поки не буде введено 0) логін. Якщо логін новий, то лічильник
# збільшується на одиницю, якщо логін вже був, то лічильник відвідувань також
# збільшується на одиницю, а число унікальних відвідувачів залишається незмінним.
# На екран має виводитися кількість відвідувань і кількість унікальних користувачів.
# Вхідні дані:
# Barbara
# Alex56
# Alex56
# Barbara
# 0
# Вихідні дані:
# 1 1
# 2 2
# 3 2
# 4 2
# 5 2
# 0

def visit_counter():
    count_visits = 0
    logins = set()

    while True:
        login = input('Enter login or "0" for exit: ')
        if login == '0':
            break
        logins.add(login)
        count_visits += 1

        print(f'{count_visits} {len(logins)}')


visit_counter()