# Напишіть функцію для перевірки, чи є число ідеальним чи ні.
# Примітка. У теорії чисел ідеальне число - це додатне ціле число,
# яке дорівнює сумі власних додатних дільників, тобто сумі додатних дільників,
# виключаючи саме число. Відповідно, ідеальне число - це число, що дорівнює
# половині суми всіх додатних дільників (включаючи саме число).
# Наприклад: перше ідеальне число - 6, оскільки 1, 2 і 3 - це п
# равильні додатні дільники, а 1 + 2 + 3 = 6. Відповідно, число 6 дорівнює половині
# суми всіх його додатних дільників: (1 + 2 + 3 + 6) / 2 = 6.
# Наступне ідеальне число - 28 = 1 + 2 + 4 + 7 + 14. Далі ідуть ідеальні числа 496 і 8128.
# Вхідні дані:
# 6
# 28
# 25
# Вихідні дані:
# True
# True
# False

def ideal_number(number: int):
    dividers = [div for div in range(1, number + 1)
                if number % div == 0]
    return number == sum(dividers) / 2


print(ideal_number(6))
print(ideal_number(28))
print(ideal_number(25))
print(ideal_number(496))
print(ideal_number(8128))