# Написати програму, яка просить ввести 4 числа – кількість днів, годин,
# хвилин і секунд. Програма виводить цей час у секундах.

dd = int(input('Введіть кількість днів: '))
hh = int(input('Введіть кількість годин: '))
mm = int(input('Введіть кількість хвилин: '))
ss = int(input('Введіть кількість секунд: '))

time_ss = print('Загальний час у секундах:', dd * 86400 + hh * 3600 + mm * 60 + ss)

# Рішення викладача:

days = int(input('Введите кількість днів: '))
hours = int(input('Введите кількість годин: '))
minutes = int(input('Введите кількість хвилин: '))
sec = int(input('Введите кількість секунд: '))

result = days * 24 * 60 * 60 + hours * 60 * 60 + minutes * 60 + sec

print('Кількість секунд:', result)