# Напишіть програму, яка запитує у користувача ціле позитивне число і перевіряє,
# чи є воно простим. Просте число - це число, яке ділиться тільки на 1 і на само
# себе без залишку. Використовуйте цикл і перевірку поділу числа на всі числа
# від 2 до N-1 для вирішення задачі.
# Виведіть відповідне повідомлення на екран за допомогою print.
#
# Приклад:
# Введіть позитивне число: 17
# Число 17 є простим.

n = int(input('Введіть ціле позитивне число: n = '))

if n > 1:
    for i in range(2, n):
        if n % i == 0:
            print(f'Число {n} НЕ просте')
            break
    else:
        print(f'Число {n} є ПРОСТИМ')
else:
    print(f'Число {n} НЕ просте')

