# Напишіть програму, яка запитує у користувача натуральне десяткове число і
# виводить його двійкове уявлення. Реалізуйте алгоритм переведення числа в
# двійкову систему числення, використовуючи основні концепції подання чисел
# (підказка: через розподіл із залишком). Виведіть отримане подання числа на екран.
#
# Приклад:
# Введіть натуральне десяткове число: 123
# Двійкове уявлення числа: 1111011

n = int(input('Введіть натуральне десяткове число: '))
print('Десяткове число:', n, sep='\t')
dg10 = []

while n > 0:
    dg10.insert(0, n % 2)
    n = n // 2

print('Двійкове число:', "".join([str(dg) for dg in dg10]), sep='\t' * 2)
print(bin(n))