# Напишіть програму, яка запитує у користувача ціле число і визначає, чи є
# воно паліндромом. Число є паліндромом, якщо воно читається однаково зліва
# направо і праворуч наліво. Виведіть відповідне повідомлення на екран за
# допомогою команди print. Використовуйте математичні операції.
# Роботу з рядками використовувати не можна.
#
# Приклад:
# Введіть ціле число: 12321
# Число є паліндромом.
# Введіть ціле число: 12323
# Число не є паліндромом.

# n = 12321
n = 1234321
nmbrs = []

while n > 0:
    n, r = divmod(n, 10)
    nmbrs.append(r)

mid = round(len(nmbrs) / 2)
print(mid)
print(sum(nmbrs[:mid]))
print(sum(nmbrs[mid:]))