# Напишіть програму, яка запитує у користувача ціле число і визначає, чи є
# воно паліндромом. Число є паліндромом, якщо воно читається однаково зліва
# направо і праворуч наліво. Виведіть відповідне повідомлення на екран за
# допомогою команди print. Використовуйте математичні операції.
# Роботу з рядками використовувати не можна.
#
# Приклад:
# Введіть ціле число: 12321
# Число є паліндромом.
# Введіть ціле число: 12323
# Число не є паліндромом.

n = 1231
# n = 1234321
nmbrs = []

while n > 0:
    n, r = divmod(n, 10)
    nmbrs.append(r)

mid = round(len(nmbrs) / 2 + 0.1)

if len(nmbrs) % 2 == 0:
    print("Число є паліндромом.") if sum(nmbrs[:mid]) == sum(nmbrs[mid:])\
        else print("Число не є паліндромом.")
elif len(nmbrs) % 2 != 0:
    print("Число є паліндромом.") if sum(nmbrs[:mid]) == sum(nmbrs[mid-1:])\
        else print("Число не є паліндромом.")
