# Напишіть програму, яка запитує у користувача ціле число і перевіряє, чи
# є воно числом Армстронга. Число Армстронга - це число, яке дорівнює сумі
# своїх цифр, зведених у ступінь, що дорівнює кількості цифр у числі.
# Виведіть відповідне повідомлення на екран за допомогою команди # print.
#
# Приклад:
# Введіть ціле число: 153 (це без виводу на екран: 153 = 1**3 + 5**3 + 3**3)
# Число є числом Армстронга.

n = int(input("Введіть ціле число: "))
sum_qu = sum([int(i) ** len(str(n)) for i in str(n)])
if n == sum_qu:
    print("Число є числом Армстронга.")