# Напишіть програму, яка приймає рядок користувача та розбиває його на окремі
# слова. Потім програма має об'єднати слова у зворотному порядку. При цьому
# перше слово у зміненому порядку друкується з великої літери, а останнє котре
# було на першому місці і було з великої літери у зворотньому порядку
# друкується з маленької літери
#
# Приклад:
# Введіть строку: Програмування це цікаво та корисно
# Перевернута строка: Корисно та цікаво це програмування

# text = input("Введіть числа через кому та пробіл: ")
text = "Програмування це цікаво та корисно"
text_list = text.lower().split()
text_list = text_list[-1::-1]
text_list[0] = text_list[0].title()
text_mod = " ".join(text_list)
print(text)
print(text_mod)
