# Напишіть програму, яка приймає рядок від користувача та розбиває його на окремі
# слова. Потім програма має створити новий кортеж, що містить довжину кожного
# слова у вихідному рядку. Використовуйте методи рядків та кортежів для обробки даних.
#
# Приклад:
# Введіть речення: Програмування це цікаво та корисно
# Довжини слів у реченні: (13, 2, 6, 2, 7)

sentence = 'Програмування це цікаво та корисно'
sent_lst = sentence.split()
print(sent_lst)

sent_tpl = tuple(len(word) for word in sent_lst)
print(sent_tpl)

# Рішення викладача:

s = input().split()
d = []
for i in s:
    d.append(len(i))
print(tuple(d))