# Напишіть програму, яка приймає рядок від користувача та підраховує
# кількість унікальних символів у цьому рядку. Створіть функцію
# count_unique_chars, яка приймає рядок та повертає кількість
# Унікальні символи. Виведіть результат на екран.
#
# Приклад:
# Введіть рядок: hello
# Кількість унікальних символів: 4

def count_unique_chars(text):
    return f'В рядку: "{text}"\nКількість унікальних символів: {len(set(text))}'


print(count_unique_chars("hello"))

# Рішення викладача:

s = set(input("Введіть рядок: "))
print("Кількість унікальних символів:", len(s))